todos/2024/2024-11/2024-11-01.org
#+OPTIONS: ^:{} H:0 num:0

* 2024-11-01
** Utopia
- [ ] integrant prep 과 prep-key deprecated 되었음
- [ ] fx-cofx 자동 예시 따오기
- [ ] malli schema 만들기
- [ ] web socket setting
- [ ] auth
- [ ] 이제까지의 모든것들 중 매크로화 할 수 있는 것들 전부 매크로화하기
** 개인 공부
*** Computer Networking
**** 7. 무선 이동 네트워크
*** Docker
**** 2. 컨테이너로 분산 애플리케이션 실행하기
- [ ] 9. 컨테이너 모니터링으로 투명성 있는 애플리케이션 만들기
- [ ] 10. 도커 컴포즈를 이용한 여러 환경 구성
- [ ] 11. 도커와 도커 컴포즈를 이용한 애플리케이션 빌드 및 테스트
*** Jenkins
*** Kubernetes
*** Prometheus Grafana
*** Elk Stack
*** RabbitMQ
*** Kafka
*** Redis
*** 데이터베이스 시스템
*** Hadoop
*** Hive
*** Scala
*** Spark
*** 데이터 중심 애플리케이션 설계
*** gRPC
*** nginX
*** Category Theory For Programmers
*** Structure and Interpretation of Computer Programs
*** The Joy of Clojure
*** Clojure 최적화
*** MongoDB
*** C++ 기초 플러스
*** CUDA C Programming
*** 밑바닥부터 시작하는 딥러닝
*** 밑바닥부터 시작하는 딥러닝 2
*** 밑바닥부터 시작하는 딥러닝 3
*** 핸즈온 머신러닝
*** Scala 머신러닝
*** SQL (고급사용 및 최적화)
*** Java 최적화
