todos/2024/2024-11/2024-11-01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-01 Fri 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="kwonryul" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="file:///home/kwonryul/.emacs.d/css/org.css" />
</head>
<body>
<div id="content" class="content">

<ul class="org-ul">
<li><a id="org415df83"></a>2024-11-01<br />
<ul class="org-ul">
<li><a id="orge8195f3"></a>Utopia<br />
<div class="outline-text-3" id="text-orge8195f3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> integrant prep 과 prep-key deprecated 되었음</li>
<li class="off"><code>[&#xa0;]</code> fx-cofx 자동 예시 따오기</li>
<li class="off"><code>[&#xa0;]</code> malli schema 만들기</li>
<li class="off"><code>[&#xa0;]</code> web socket setting</li>
<li class="off"><code>[&#xa0;]</code> auth</li>
<li class="off"><code>[&#xa0;]</code> 이제까지의 모든것들 중 매크로화 할 수 있는 것들 전부 매크로화하기</li>
</ul>
</div>
</li>
<li><a id="org6efc8a9"></a>개인 공부<br />
<ul class="org-ul">
<li><a id="orgcdb381e"></a>Computer Networking<br />
<ul class="org-ul">
<li><a id="orgeaf82a3"></a>7. 무선 이동 네트워크<br /></li>
</ul>
</li>
<li><a id="orga9ca3fe"></a>Docker<br />
<ul class="org-ul">
<li><a id="org7e85e11"></a>2. 컨테이너로 분산 애플리케이션 실행하기<br />
<div class="outline-text-5" id="text-org7e85e11">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> 9. 컨테이너 모니터링으로 투명성 있는 애플리케이션 만들기</li>
<li class="off"><code>[&#xa0;]</code> 10. 도커 컴포즈를 이용한 여러 환경 구성</li>
<li class="off"><code>[&#xa0;]</code> 11. 도커와 도커 컴포즈를 이용한 애플리케이션 빌드 및 테스트</li>
</ul>
</div>
</li>
</ul>
</li>
<li><a id="org9f15269"></a>Jenkins<br /></li>
<li><a id="org431eeb0"></a>Kubernetes<br /></li>
<li><a id="orgde19d5e"></a>Prometheus Grafana<br /></li>
<li><a id="org733725e"></a>Elk Stack<br /></li>
<li><a id="org3966c0b"></a>RabbitMQ<br /></li>
<li><a id="org1f14d4a"></a>Kafka<br /></li>
<li><a id="orgcb0554a"></a>Redis<br /></li>
<li><a id="org3f26cc7"></a>데이터베이스 시스템<br /></li>
<li><a id="orgbbefb55"></a>Hadoop<br /></li>
<li><a id="org17e3cd0"></a>Hive<br /></li>
<li><a id="org0212258"></a>Scala<br /></li>
<li><a id="orgbf2bec6"></a>Spark<br /></li>
<li><a id="orgae2b2ca"></a>데이터 중심 애플리케이션 설계<br /></li>
<li><a id="orgd89e0d6"></a>gRPC<br /></li>
<li><a id="orgc9a07c9"></a>nginX<br /></li>
<li><a id="orga0a7e82"></a>Category Theory For Programmers<br /></li>
<li><a id="orgc0fb530"></a>Structure and Interpretation of Computer Programs<br /></li>
<li><a id="org2bef958"></a>The Joy of Clojure<br /></li>
<li><a id="orga20f7d4"></a>Clojure 최적화<br /></li>
<li><a id="orgb61b93a"></a>MongoDB<br /></li>
<li><a id="orgc41b62f"></a>C++ 기초 플러스<br /></li>
<li><a id="org625676e"></a>CUDA C Programming<br /></li>
<li><a id="org7e27c10"></a>밑바닥부터 시작하는 딥러닝<br /></li>
<li><a id="org05bef2c"></a>밑바닥부터 시작하는 딥러닝 2<br /></li>
<li><a id="orge5fb86d"></a>밑바닥부터 시작하는 딥러닝 3<br /></li>
<li><a id="org5f97f51"></a>핸즈온 머신러닝<br /></li>
<li><a id="org898db26"></a>Scala 머신러닝<br /></li>
<li><a id="orgd99a61a"></a>SQL (고급사용 및 최적화)<br /></li>
<li><a id="org0d344f2"></a>Java 최적화<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="author">Author: kwonryul</p>
<p class="date">Created: 2024-11-01 Fri 15:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
